Revit 2026 API

# ViewSheetFailures Properties

---

The BuiltInFailuresViewSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewInAModelMustBeUnique | Sheet views in this model cannot contain more than one instance of "%1!s!." |
|  | ViewInAModelMustBeUniqueWarn | Sheet views in this model cannot contain more than one instance of "%1!s!." |
|  | ViewOnASheetCannotBeUncropped3DPerspectiveView | Sheets do not support uncropped perspective views. |
|  | ViewOnASheetMustBeUnique | Sheet views cannot contain more than one instance of "%1!s!." |
|  | ViewOnASheetMustBeUniqueWarn | Sheet views cannot contain more than one instance of "%1!s!." |
|  | ViewportCantContainEmptyView | Sheet views cannot contain empty view "%1!s!". |

#### Reference

BuiltInFailuresViewSheetFailures Class

Autodesk.Revit.DB Namespace